sterentev/atdf-device-asm-include/inc/ATmega2560.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	UDR2		= 0xD6		; [MEMORY MAPPED] USART I/O Data Register
.equ	UBRR2		= 0xD4		; [MEMORY MAPPED] [___2 addrs___] USART Baud Rate Register  Bytes
.equ	UCSR2C		= 0xD2		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSR2B		= 0xD1		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSR2A		= 0xD0		; [MEMORY MAPPED] USART Control and Status Register A
.equ	UDR1		= 0xCE		; [MEMORY MAPPED] USART I/O Data Register
.equ	UBRR1		= 0xCC		; [MEMORY MAPPED] [___2 addrs___] USART Baud Rate Register  Bytes
.equ	UCSR1C		= 0xCA		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSR1B		= 0xC9		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSR1A		= 0xC8		; [MEMORY MAPPED] USART Control and Status Register A
.equ	UDR0		= 0xC6		; [MEMORY MAPPED] USART I/O Data Register
.equ	UBRR0		= 0xC4		; [MEMORY MAPPED] [___2 addrs___] USART Baud Rate Register  Bytes
.equ	UCSR0C		= 0xC2		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSR0B		= 0xC1		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSR0A		= 0xC0		; [MEMORY MAPPED] USART Control and Status Register A
.equ	TWAMR		= 0xBD		; [MEMORY MAPPED] TWI (Slave) Address Mask Register
.equ	TWCR		= 0xBC		; [MEMORY MAPPED] TWI Control Register
.equ	TWDR		= 0xBB		; [MEMORY MAPPED] TWI Data register
.equ	TWAR		= 0xBA		; [MEMORY MAPPED] TWI (Slave) Address register
.equ	TWSR		= 0xB9		; [MEMORY MAPPED] TWI Status Register
.equ	TWBR		= 0xB8		; [MEMORY MAPPED] TWI Bit Rate register
.equ	ASSR		= 0xB6		; [MEMORY MAPPED] Asynchronous Status Register
.equ	OCR2B		= 0xB4		; [MEMORY MAPPED] Timer/Counter2 Output Compare Register B
.equ	OCR2A		= 0xB3		; [MEMORY MAPPED] Timer/Counter2 Output Compare Register A
.equ	TCNT2		= 0xB2		; [MEMORY MAPPED] Timer/Counter2
.equ	TCCR2B		= 0xB1		; [MEMORY MAPPED] Timer/Counter2 Control Register B
.equ	TCCR2A		= 0xB0		; [MEMORY MAPPED] Timer/Counter2 Control Register A
.equ	OCR4C		= 0xAC		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4 Output Compare Register B  Bytes
.equ	OCR4B		= 0xAA		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4 Output Compare Register B  Bytes
.equ	OCR4A		= 0xA8		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4 Output Compare Register A  Bytes
.equ	ICR4		= 0xA6		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4 Input Capture Register  Bytes
.equ	TCNT4		= 0xA4		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter4  Bytes
.equ	TCCR4C		= 0xA2		; [MEMORY MAPPED] Timer/Counter 4 Control Register C
.equ	TCCR4B		= 0xA1		; [MEMORY MAPPED] Timer/Counter4 Control Register B
.equ	TCCR4A		= 0xA0		; [MEMORY MAPPED] Timer/Counter4 Control Register A
.equ	OCR3C		= 0x9C		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3B		= 0x9A		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3A		= 0x98		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output Compare Register A  Bytes
.equ	ICR3		= 0x96		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Input Capture Register  Bytes
.equ	TCNT3		= 0x94		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3  Bytes
.equ	TCCR3C		= 0x92		; [MEMORY MAPPED] Timer/Counter 3 Control Register C
.equ	TCCR3B		= 0x91		; [MEMORY MAPPED] Timer/Counter3 Control Register B
.equ	TCCR3A		= 0x90		; [MEMORY MAPPED] Timer/Counter3 Control Register A
.equ	OCR1C		= 0x8C		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Output Compare Register C  Bytes
.equ	OCR1B		= 0x8A		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Output Compare Register B  Bytes
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Output Compare Register A  Bytes
.equ	ICR1		= 0x86		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Input Capture Register  Bytes
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1  Bytes
.equ	TCCR1C		= 0x82		; [MEMORY MAPPED] Timer/Counter 1 Control Register C
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter1 Control Register A
.equ	DIDR1		= 0x7F		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register
.equ	DIDR2		= 0x7D		; [MEMORY MAPPED] Digital Input Disable Register
.equ	ADMUX		= 0x7C		; [MEMORY MAPPED] The ADC multiplexer Selection Register
.equ	ADCSRB		= 0x7B		; [MEMORY MAPPED] ADC Control and Status Register B
.equ	ADCSRA		= 0x7A		; [MEMORY MAPPED] The ADC Control and Status register A
.equ	ADC		= 0x78		; [MEMORY MAPPED] [___2 addrs___] ADC Data Register  Bytes
.equ	XMCRB		= 0x75		; [MEMORY MAPPED] External Memory Control Register B
.equ	XMCRA		= 0x74		; [MEMORY MAPPED] External Memory Control Register A
.equ	TIMSK5		= 0x73		; [MEMORY MAPPED] Timer/Counter5 Interrupt Mask Register
.equ	TIMSK4		= 0x72		; [MEMORY MAPPED] Timer/Counter4 Interrupt Mask Register
.equ	TIMSK3		= 0x71		; [MEMORY MAPPED] Timer/Counter3 Interrupt Mask Register
.equ	TIMSK2		= 0x70		; [MEMORY MAPPED] Timer/Counter Interrupt Mask register
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter1 Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter0 Interrupt Mask Register
.equ	PCMSK2		= 0x6D		; [MEMORY MAPPED] Pin Change Mask Register 2
.equ	PCMSK1		= 0x6C		; [MEMORY MAPPED] Pin Change Mask Register 1
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Mask Register 0
.equ	EICRB		= 0x6A		; [MEMORY MAPPED] External Interrupt Control Register B
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register A
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	OSCCAL		= 0x66		; [MEMORY MAPPED] Oscillator Calibration Value
.equ	PRR1		= 0x65		; [MEMORY MAPPED] Power Reduction Register1
.equ	PRR0		= 0x64		; [MEMORY MAPPED] Power Reduction Register0
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] 
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; [___2 addrs___] Stack Pointer 
.equ	EIND		= 0x3C		; Extended Indirect Register
.equ	RAMPZ		= 0x3B		; RAM Page Z Select Register
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	OCDR		= 0x31		; On-Chip Debug Related Register in I/O Memory
.equ	ACSR		= 0x30		; Analog Comparator Control And Status Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	GPIOR2		= 0x2B		; General Purpose IO Register 2
.equ	GPIOR1		= 0x2A		; General Purpose IO Register 1
.equ	OCR0B		= 0x28		; Timer/Counter0 Output Compare Register
.equ	OCR0A		= 0x27		; Timer/Counter0 Output Compare Register
.equ	TCNT0		= 0x26		; Timer/Counter0
.equ	TCCR0B		= 0x25		; Timer/Counter Control Register B
.equ	TCCR0A		= 0x24		; Timer/Counter  Control Register A
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; [___2 addrs___] EEPROM Address Register Low Bytes
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	TIFR5		= 0x1A		; Timer/Counter5 Interrupt Flag register
.equ	TIFR4		= 0x19		; Timer/Counter4 Interrupt Flag register
.equ	TIFR3		= 0x18		; Timer/Counter3 Interrupt Flag register
.equ	TIFR2		= 0x17		; Timer/Counter Interrupt Flag Register
.equ	TIFR1		= 0x16		; Timer/Counter1 Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter0 Interrupt Flag register
.equ	PORTG		= 0x14		; Data Register, Port G
.equ	DDRG		= 0x13		; Data Direction Register, Port G
.equ	PING		= 0x12		; Input Pins, Port G
.equ	PORTF		= 0x11		; Data Register, Port F
.equ	DDRF		= 0x10		; Data Direction Register, Port F
.equ	PINF		= 0x0F		; Input Pins, Port F
.equ	PORTE		= 0x0E		; Data Register, Port E
.equ	DDRE		= 0x0D		; Data Direction Register, Port E
.equ	PINE		= 0x0C		; Input Pins, Port E
.equ	PORTD		= 0x0B		; Port D Data Register
.equ	DDRD		= 0x0A		; Port D Data Direction Register
.equ	PIND		= 0x09		; Port D Input Pins
.equ	PORTC		= 0x08		; Port C Data Register
.equ	DDRC		= 0x07		; Port C Data Direction Register
.equ	PINC		= 0x06		; Port C Input Pins
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Port A Data Direction Register
.equ	PINA		= 0x00		; Port A Input Pins
.equ	UDR3		= 0x0136	; [MEMORY MAPPED] USART I/O Data Register
.equ	UBRR3		= 0x0134	; [MEMORY MAPPED] [___2 addrs___] USART Baud Rate Register Bytes
.equ	UCSR3C		= 0x0132	; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSR3B		= 0x0131	; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSR3A		= 0x0130	; [MEMORY MAPPED] USART Control and Status Register A
.equ	OCR5C		= 0x012C	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5 Output Compare Register B  Bytes
.equ	OCR5B		= 0x012A	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5 Output Compare Register B  Bytes
.equ	OCR5A		= 0x0128	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5 Output Compare Register A  Bytes
.equ	ICR5		= 0x0126	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5 Input Capture Register  Bytes
.equ	TCNT5		= 0x0124	; [MEMORY MAPPED] [___2 addrs___] Timer/Counter5  Bytes
.equ	TCCR5C		= 0x0122	; [MEMORY MAPPED] Timer/Counter 5 Control Register C
.equ	TCCR5B		= 0x0121	; [MEMORY MAPPED] Timer/Counter5 Control Register B
.equ	TCCR5A		= 0x0120	; [MEMORY MAPPED] Timer/Counter5 Control Register A
.equ	PORTL		= 0x010B	; [MEMORY MAPPED] PORT L Data Register
.equ	DDRL		= 0x010A	; [MEMORY MAPPED] PORT L Data Direction Register
.equ	PINL		= 0x0109	; [MEMORY MAPPED] PORT L Input Pins
.equ	PORTK		= 0x0108	; [MEMORY MAPPED] PORT K Data Register
.equ	DDRK		= 0x0107	; [MEMORY MAPPED] PORT K Data Direction Register
.equ	PINK		= 0x0106	; [MEMORY MAPPED] PORT K Input Pins
.equ	PORTJ		= 0x0105	; [MEMORY MAPPED] PORT J Data Register
.equ	DDRJ		= 0x0104	; [MEMORY MAPPED] PORT J Data Direction Register
.equ	PINJ		= 0x0103	; [MEMORY MAPPED] PORT J Input Pins
.equ	PORTH		= 0x0102	; [MEMORY MAPPED] PORT H Data Register
.equ	DDRH		= 0x0101	; [MEMORY MAPPED] PORT H Data Direction Register
.equ	PINH		= 0x0100	; [MEMORY MAPPED] PORT H Input Pins
;
; ----------	REGISTERS PAIRS			------------------------
;    USART Baud Rate Register  Bytes
.equ	UBRR2H		= 0xD5
.equ	UBRR2L		= 0xD4
;    USART Baud Rate Register  Bytes
.equ	UBRR1H		= 0xCD
.equ	UBRR1L		= 0xCC
;    USART Baud Rate Register  Bytes
.equ	UBRR0H		= 0xC5
.equ	UBRR0L		= 0xC4
;    Timer/Counter4 Output Compare Register B  Bytes
.equ	OCR4CH		= 0xAD
.equ	OCR4CL		= 0xAC
;    Timer/Counter4 Output Compare Register B  Bytes
.equ	OCR4BH		= 0xAB
.equ	OCR4BL		= 0xAA
;    Timer/Counter4 Output Compare Register A  Bytes
.equ	OCR4AH		= 0xA9
.equ	OCR4AL		= 0xA8
;    Timer/Counter4 Input Capture Register  Bytes
.equ	ICR4H		= 0xA7
.equ	ICR4L		= 0xA6
;    Timer/Counter4  Bytes
.equ	TCNT4H		= 0xA5
.equ	TCNT4L		= 0xA4
;    Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3CH		= 0x9D
.equ	OCR3CL		= 0x9C
;    Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3BH		= 0x9B
.equ	OCR3BL		= 0x9A
;    Timer/Counter3 Output Compare Register A  Bytes
.equ	OCR3AH		= 0x99
.equ	OCR3AL		= 0x98
;    Timer/Counter3 Input Capture Register  Bytes
.equ	ICR3H		= 0x97
.equ	ICR3L		= 0x96
;    Timer/Counter3  Bytes
.equ	TCNT3H		= 0x95
.equ	TCNT3L		= 0x94
;    Timer/Counter1 Output Compare Register C  Bytes
.equ	OCR1CH		= 0x8D
.equ	OCR1CL		= 0x8C
;    Timer/Counter1 Output Compare Register B  Bytes
.equ	OCR1BH		= 0x8B
.equ	OCR1BL		= 0x8A
;    Timer/Counter1 Output Compare Register A  Bytes
.equ	OCR1AH		= 0x89
.equ	OCR1AL		= 0x88
;    Timer/Counter1 Input Capture Register  Bytes
.equ	ICR1H		= 0x87
.equ	ICR1L		= 0x86
;    Timer/Counter1  Bytes
.equ	TCNT1H		= 0x85
.equ	TCNT1L		= 0x84
;    ADC Data Register  Bytes
.equ	ADCH		= 0x79
.equ	ADCL		= 0x78
;    Stack Pointer 
.equ	SPH		= 0x3E
.equ	SPL		= 0x3D
;    EEPROM Address Register Low Bytes
.equ	EEARH		= 0x22
.equ	EEARL		= 0x21
;    USART Baud Rate Register Bytes
.equ	UBRR3H		= 0x0135
.equ	UBRR3L		= 0x0134
;    Timer/Counter5 Output Compare Register B  Bytes
.equ	OCR5CH		= 0x012D
.equ	OCR5CL		= 0x012C
;    Timer/Counter5 Output Compare Register B  Bytes
.equ	OCR5BH		= 0x012B
.equ	OCR5BL		= 0x012A
;    Timer/Counter5 Output Compare Register A  Bytes
.equ	OCR5AH		= 0x0129
.equ	OCR5AL		= 0x0128
;    Timer/Counter5 Input Capture Register  Bytes
.equ	ICR5H		= 0x0127
.equ	ICR5L		= 0x0126
;    Timer/Counter5  Bytes
.equ	TCNT5H		= 0x0125
.equ	TCNT5L		= 0x0124


; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADCSRB bits		------------------------
.equ	ACME		= 6		; 0x40 - Analog Comparator Multiplexer Enable

; ----------	Register ACSR bits		------------------------
.equ	ACD		= 7		; 0x80 - Analog Comparator Disable
.equ	ACBG		= 6		; 0x40 - Analog Comparator Bandgap Select
.equ	ACO		= 5		; 0x20 - Analog Compare Output
.equ	ACI		= 4		; 0x10 - Analog Comparator Interrupt Flag
.equ	ACIE		= 3		; 0x08 - Analog Comparator Interrupt Enable
.equ	ACIC		= 2		; 0x04 - Analog Comparator Input Capture Enable
.equ	ACIS_MASK	= 0x03		;      - Analog Comparator Interrupt Mode Select bits (2 bits)
.equ	ACIS0		= 0		;          ACIS BIT0 position
; ::::  ACIS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge

