sterentev/atdf-device-asm-include/inc/ATmega2560.inc
; ----------	Register DIDR1 bits		------------------------
.equ	AIN1D		= 1		; 0x02 - AIN1 Digital Input Disable
.equ	AIN0D		= 0		; 0x01 - AIN0 Digital Input Disable



; ====	USART MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register UCSR0A bits		------------------------
.equ	RXC0		= 7		; 0x80 - USART Receive Complete
.equ	TXC0		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE0		= 5		; 0x20 - USART Data Register Empty
.equ	FE0		= 4		; 0x10 - Framing Error
.equ	DOR0		= 3		; 0x08 - Data overRun
.equ	UPE0		= 2		; 0x04 - Parity Error
.equ	U2X0		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM0		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR0B bits		------------------------
.equ	RXCIE0		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE0		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE0		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN0		= 4		; 0x10 - Receiver Enable
.equ	TXEN0		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ02		= 2		; 0x04 - Character Size
.equ	RXB80		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB80		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR0C bits		------------------------
.equ	UMSEL0_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL00		= 6		;          UMSEL0 BIT0 position
.equ	UPM0_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM00		= 4		;          UPM0 BIT0 position
.equ	USBS0		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ0_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ00		= 1		;          UCSZ0 BIT0 position
.equ	UCPOL0		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL0	:::: bitfield values
;			0x00		; Asynchronous USART
;			0x40		; Synchronous USART
;			0xC0		; Master SPI
; ::::  UPM0	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS0	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSR1A bits		------------------------
.equ	RXC1		= 7		; 0x80 - USART Receive Complete
.equ	TXC1		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE1		= 5		; 0x20 - USART Data Register Empty
.equ	FE1		= 4		; 0x10 - Framing Error
.equ	DOR1		= 3		; 0x08 - Data overRun
.equ	UPE1		= 2		; 0x04 - Parity Error
.equ	U2X1		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM1		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR1B bits		------------------------
.equ	RXCIE1		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE1		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE1		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN1		= 4		; 0x10 - Receiver Enable
.equ	TXEN1		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ12		= 2		; 0x04 - Character Size
.equ	RXB81		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB81		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR1C bits		------------------------
.equ	UMSEL1_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL10		= 6		;          UMSEL1 BIT0 position
.equ	UPM1_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM10		= 4		;          UPM1 BIT0 position
.equ	USBS1		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ1_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ10		= 1		;          UCSZ1 BIT0 position
.equ	UCPOL1		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL1	:::: bitfield values
;			0x00		; Asynchronous USART
;			0x40		; Synchronous USART
;			0xC0		; Master SPI
; ::::  UPM1	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS1	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSR2A bits		------------------------
.equ	RXC2		= 7		; 0x80 - USART Receive Complete
.equ	TXC2		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE2		= 5		; 0x20 - USART Data Register Empty
.equ	FE2		= 4		; 0x10 - Framing Error
.equ	DOR2		= 3		; 0x08 - Data overRun
.equ	UPE2		= 2		; 0x04 - Parity Error
.equ	U2X2		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM2		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR2B bits		------------------------
.equ	RXCIE2		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE2		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE2		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN2		= 4		; 0x10 - Receiver Enable
.equ	TXEN2		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ22		= 2		; 0x04 - Character Size
.equ	RXB82		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB82		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR2C bits		------------------------
.equ	UMSEL2_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL20		= 6		;          UMSEL2 BIT0 position
.equ	UPM2_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM20		= 4		;          UPM2 BIT0 position
.equ	USBS2		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ2_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ20		= 1		;          UCSZ2 BIT0 position
.equ	UCPOL2		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL2	:::: bitfield values
;			0x00		; Asynchronous USART
;			0x40		; Synchronous USART
;			0xC0		; Master SPI
; ::::  UPM2	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS2	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSR3A bits		------------------------
.equ	RXC3		= 7		; 0x80 - USART Receive Complete
.equ	TXC3		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE3		= 5		; 0x20 - USART Data Register Empty
.equ	FE3		= 4		; 0x10 - Framing Error
.equ	DOR3		= 3		; 0x08 - Data overRun
.equ	UPE3		= 2		; 0x04 - Parity Error
.equ	U2X3		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM3		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR3B bits		------------------------
.equ	RXCIE3		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE3		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE3		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN3		= 4		; 0x10 - Receiver Enable
.equ	TXEN3		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ32		= 2		; 0x04 - Character Size
.equ	RXB83		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB83		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR3C bits		------------------------
.equ	UMSEL3_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL30		= 6		;          UMSEL3 BIT0 position
.equ	UPM3_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM30		= 4		;          UPM3 BIT0 position
.equ	USBS3		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ3_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ30		= 1		;          UCSZ3 BIT0 position
.equ	UCPOL3		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL3	:::: bitfield values
;			0x00		; Asynchronous USART
;			0x40		; Synchronous USART
;			0xC0		; Master SPI
; ::::  UPM3	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS3	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit



; ====	TWI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TWAMR bits		------------------------
.equ	TWAM_MASK	= 0xFE		;      -  (7 bits)
.equ	TWAM0		= 1		;          TWAM BIT0 position

; ----------	Register TWCR bits		------------------------
.equ	TWINT		= 7		; 0x80 - TWI Interrupt Flag
.equ	TWEA		= 6		; 0x40 - TWI Enable Acknowledge Bit
.equ	TWSTA		= 5		; 0x20 - TWI Start Condition Bit
.equ	TWSTO		= 4		; 0x10 - TWI Stop Condition Bit
.equ	TWWC		= 3		; 0x08 - TWI Write Collision Flag
.equ	TWEN		= 2		; 0x04 - TWI Enable Bit
.equ	TWIE		= 0		; 0x01 - TWI Interrupt Enable

; ----------	Register TWSR bits		------------------------
.equ	TWS_MASK	= 0xF8		;      - TWI Status (5 bits)
.equ	TWS0		= 3		;          TWS BIT0 position
.equ	TWPS_MASK	= 0x03		;      - TWI Prescaler (2 bits)
.equ	TWPS0		= 0		;          TWPS BIT0 position
; ::::  TWPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 4
;			0x02		; 16
;			0x03		; 64

; ----------	Register TWAR bits		------------------------
.equ	TWA_MASK	= 0xFE		;      - TWI (Slave) Address register Bits (7 bits)
.equ	TWA0		= 1		;          TWA BIT0 position
.equ	TWGCE		= 0		; 0x01 - TWI General Call Recognition Enable Bit



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)

